// 1
/*
internal prototype ([[Prototype]]) դա թաքնված, ներքին հղում է, որը կա յուրաքանչյուր JavaScript օբյեկտի մեջ։
Այն կապում է օբյեկտը մեկ այլ օբյեկտի՝ նրա պրոտոտիպի հետ, որպեսզի այդ օբյեկտը կարողանա ժառանգել հատկություններ և մեթոդներ։ */

// 2
/*
external prototype ֆունկցիայի .prototype property-ն է։
Այն օգտագործվում է միայն այն դեպքում, երբ այդ ֆունկցիան կանչում ես new-ով։
JavaScript-ում յուրաքանչյուր ֆունկցիա ավտոմատ ստանում է .prototype օբյեկտ։
Այդ .prototype-ը ֆունկցիայի սեփական պրոտոտիպը չէ։
Այս .prototype-ը ֆունկցիայի սեփական պրոտոտիպը չէ, դա պարզապես մի ձևանմուշ է,
որը new-ով ստեղծվող օբյեկտների համար կդառնա նրանց ներքին պրոտոտիպը ([[Prototype]])։ */

//3
/*
Object, Array, Function, Date, RegExp, օբյեկտ literal {}, դատարկ օբյեկտ Object.create() */

//4
/*
Միայն ֆունկցիաները, և դա օգտագործվում է միայն այն դեպքում, եթե ֆունկցիան կանչվում է որպես constructor (new-ով)։ */

//5
/* 
JavaScript-ում internal ([[Prototype]]) և external(.prototype) պրոտոտիպները միանում են, երբ օգտագործում ես new օպերատորը։
Երբ մենք գրենք՝ let obj = new F();
JS-ը իրականացնում է հետևյալը․

1․Ստեղծում է նոր դատարկ օբյեկտ։
2․Նոր օբյեկտի [[Prototype]]-ը կապում է F.prototype-ին։
3․Կանչում է F ֆունկցիան այդ նոր օբյեկտի context-ով։
4․Վերադարձնում է այդ օբյեկտը։

Այսինքն՝
new = .prototype դառնում է [[Prototype]]*/